{"includedInDataCatalog": {"name": "Figshare"}, "versionDate": "2022-05-13T11:20:15.441884", "name": "Origin of the balanomorph barnacles (Crustacea, Cirripedia, Thoracica): new evidence from the Late Cretaceous (Campanian) of Sweden", "author": [{"name": "Gale, Andrew Scott"}, {"name": "Sørensen, Anne Mehlin"}], "keywords": ["Genetics", "Molecular Biology", "Pharmacology", "Evolutionary Biology", "Ecology", "Plant Biology", "Environmental Sciences not elsewhere classified", "Biological Sciences not elsewhere classified", "Chemical Sciences not elsewhere classified", "Cirripedia", "balanomorpha", "Cretaceous", "phylogeny"], "description": "<p>New material of thoracican cirripedes, traditionally assigned to Brachylepadomorpha and basal Balanomorpha, is described from abundant isolated plates collected from sediment deposited between boulders on a rocky coastline of Late Campanian age (<i>c</i>. 80 Ma) at Ivö Klack in Scania, southern Sweden. Two new genera, <i>Epibrachylepas</i> Gale gen. nov. and <i>Parabrachylepas</i> Gale gen. nov. (type species <i>P. ifoensis</i> Withers, <a href=\"#cit0058\" target=\"_blank\">1935</a>) are described, as is a new species, <i>Epibrachylepas newmani</i> Gale sp. nov<i>. Pachydiadema cretacea</i> Withers, <a href=\"#cit0058\" target=\"_blank\">1935</a> and <i>Brachylepas guascoi</i> (Bosquet, <a href=\"#cit0007\" target=\"_blank\">1857</a>) are redescribed on the basis of extensive new material. It is concluded that the long-held homologies between lateral plates of pedunculate cirripedes and balanomorphs are incorrect, and a new nomenclature is proposed for the latter group. Cladistic analysis based on 40 morphological characters of 12 species yields a consensus tree showing successive <i>Brachylepas</i> species and <i>Pachydiadema</i> as sister taxa to the crown group balanomorphs, which are here called Neobalanomorpha Gale suborder nov. Both ‘Brachylepadomorpha’ and ‘Brachylepadidae’ are paraphyletic, and together with <i>P. cretacea</i> form a morphocline leading from pedunculate ancestors (<i>Pycnolepas articulata</i>), through to basal sessile forms (<i>B. naissanti</i>, <i>B. guascoi</i>) and on to taxa identified as basal balanomorphs (<i>Parabrachylepas</i>, <i>Epibrachylepas</i>, <i>Pachydiadema</i>). The functional significance of the progressive changes is discussed with reference to living taxa. It is suggested that the radiation of Neobalanomorpha, dominant shallow water thoracicans in the Cenozoic, postdated the K-Pg near-extinction of more basal sessile barnacle groups.</p> <p><a href=\"http://zoobank.org/urn:lsid:zoobank.org:pub:BB41A405-C0AE-472D-AD09-77D39C6A32FC\" target=\"_blank\">http://zoobank.org/urn:lsid:zoobank.org:pub:BB41A405-C0AE-472D-AD09-77D39C6A32FC</a></p>", "dateModified": "2016-01-19", "sdPublisher": "Taylor & Francis Group/Journal of Systematic Palaeontology", "@type": "Dataset", "identifier": "10.6084/m9.figshare.1192460.v7", "doi": "10.6084/m9.figshare.1192460.v7", "distribution": {"url": "https://ndownloader.figshare.com/files/1703333"}, "url": "https://figshare.com/articles/dataset/Origin_of_the_balanomorph_barnacles_Crustacea_Cirripedia_Thoracica_new_evidence_from_the_Late_Cretaceous_Campanian_of_Sweden/1192460", "_id": "Figshare_1192460", "license": "https://creativecommons.org/licenses/by/4.0/", "datePublished": "2015-09-02"}